### СПИСОК

**Объявление списка:**
```py
l = [] #пустой список
l = list() #тоже пустой список, просто другая запись. list - класс, l - объект класса list. 
l2 = ["cat", "dog"] #создадим еще один список с заранее заданными двумя элементами
```

**Методы:**
```py
l.append("text") #добавление строки в конец списка l
l.remove("text") #удаление "text" из списка l
print(l) #вывод всего списка
l.sort() #сортирует массив. возвращает None.
"5-4-rr-t".split("-") #превратит строку "5-4-rr-t" в список ["5", "4", "rr", "t"]
random.choice(l) #вернет случайный элемент списка l

#Так же мы можем складывать списки
res = [1,2,3,4] + ["r", "tt"] #посмотрите, чему равно значение переменной res
```

**Конструкции:**

*Определяет, есть ли элемент "cat" в списке l2. Возвращает булевское значение (True или False)*
```py
"cat" in l2 

if "cat" in l2: #можно использовать в условиях
    res = "кота нашли"
else:
    res = "кота не нашли :("
```

*А здесь мы пробегаемся по элементам списка и выводим их на экран*
```py
for el in l2:
    print(el)
```

*Аналогичного результата можно добиться так:*
```py
ln = len(l2) #длина списка, т.е. количество элементов

for i in range(ln):
    print(l2[i]) 
```